{"rule_id":"Brute_Force_Attempt", "name":"Brute Force Attempt", "description":"Detects multiple failed login attempts from the same IP within 10 minutes.", "risk_score":35, "severity":"medium", "type":"threshold", "index":["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "language":"kuery", "query":"event.code : "4625"", "threshold":{"field":["user.name"],"value":5, "interval":"10m", "from":"now-10m", "actions":[{"group":"default", "id":"elastic-cloud-email", "action_type_id":".email", "params":{"to":["jycybersec@gmail.com"], "subject":"Brute Force Attempt", "message":"Rule {{context.rule.name}} generated {{state.signals_count}} alerts"}}]}
