{"rule_id":"Malicious_Process_Execution","name":"Malicious Process Execution","description":"Detects a variety of known malicious process executions.","risk_score":43,"severity":"medium","type":"query","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"language":"kuery","query":"process.args: *nmap* or process.args: *ncrack* or process.args: *mimikatz* or process.command_line.text: \"*powershell.exe -ExecutionPolicy Bypass -File*\" or process.command_line.text: \"*cmd.exe /c*\" or process.args: *wmic* or process.args: *mshta* or process.command_line.text: \"*bitsadmin /transfer*\" or process.command_line.text: \"*certutil -urlcache*\" or process.command_line.text: \"*rundll32.exe javascript:*\" or process.command_line.text: \"*regsvr32 /s /n /u /i:*\" or process.command_line.text: \"*msbuild.exe /p:*\" or process.command_line.text: \"*schtasks /run /tn*\" or process.args: *agenttesla* or process.args: *azorult* or process.args: *formbook* or process.args: *ursnif* or process.args: *lokibot* or process.args: *nanocore* or process.args: *qakbot* or process.args: *remcos* or process.args: *trickbot* or process.args: *gootloader* or process.args: *magiclantern* or process.args: *finfisher* or process.args: *warriorpride* or process.args: *netbus* or process.args: *beast* or process.args: *blackhole* or process.args: *gh0strat* or process.args: *tinybanker* or process.args: *clickbot* or process.args: *zeus* or process.args: *shedun*","interval":"5m","from":"now-1m","actions":[{"group":"default","id":"elastic-cloud-email","action_type_id":".email","params":{"to":["jycybersec@gmail.com"],"subject":"Malicious Process Execution","message":"Rule {{context.rule.name}} generated {{state.signals_count}} alerts"}}]}