{"rule_id":"uncommon_directory_file_execution","name":"Suspicious File Execution","description":"Detects process start events from suspicious file paths.","type":"query","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"language":"kuery","query":"event.action:process_start and file.path:(/tmp/* or /dev/shm/*)","risk_score":50,"severity":"medium","actions":[{"group":"default","id":"elastic-cloud-email","action_type_id":".email","params":{"to":["jycybersec@gmail.com"],"subject":"Suspicious file execution detected","message":"A process was started from /tmp or /dev/shm which is uncommon and could be suspicious."}}]}
